import pandas as pd

print('----' * 30)
print('Информация о классах')

class_card = {
    'Предмет': ['Русский язык', 'Химия', 'Физика', 'Математика', 'Информатика'],
    'Номер парты': ['1', '2', '3', '4', '5'],
    'Ряд': ['Первый ряд', 'Второй ряд', 'Третий ряд', 'Четвертый ряд', 'Пятый ряд'],
    'Вариант': ['Первый', 'Второй', 'Первый', 'Второй', 'Первый'],
    'ID': ['01', '02', '03', '04', '05']
}

cc = pd.DataFrame(data=class_card)

with open('office.csv', 'a', encoding='UTF-8') as cl:
    print(cc)
