import pandas as pd

print('----' * 30)
print('Табель учащихся в средней школе № 13')

stud_card = {
    'ID': ['01', '02', '03', '04', '05'],
    'Имя': ['Пётр', 'Сергей', 'Юлия', 'Надежда', 'Светлана'],
    'Фамилия': ['Смирнов', 'Иванов', 'Соколова', 'Роднина', 'Ухова'],
    'Дата рождения': ['19.03.2005', '06.05.2005', '01.01.2006', '13.02.2005', '05.08.2005'],
    'Успеваемость': ['Троечник', 'Отличник', 'Хорошист', 'Отличник', 'Хорошист']
}

sc = pd.DataFrame(data=stud_card)

with open('learner.csv', 'a', encoding='UTF-8') as cl:
    print(sc)
